{
    "bestplanes":[
        { "category": "axis", "planes": [
        { "name": "Messerschmitt Bf 109", "img": "img/messerschmitt.jpg", "description": "Having seen extensive service during the Spanish Civil War, early-model Bf 109s had given way to the Bf 109E by the spring of 1940. The Bf 109E series offered superior diving performance and various armament options, including the common layout of two cannon plus two machine-guns. The result was a highly effective fighter, but the operational circumstances of the Battle of Britain meant the odds were stacked heavily against it.<br>The German fighter pilots knew that their aircraft had an edge in performance over the British Hurricanes and Spitfires and their twin cannon had proved highly effective. But when they were forced to escort the Luftwaffe's bombers further inland, they began to lose their initial advantage.<br>As long as they were allowed to cross the Channel at altitudes of around 9000 m (29,000 ft) and engage the British fighters in open combat, the 'Emils' more than held their own. Tied though, they lost their independence and before the introduction of the drop tank equipped Bf 109E-7, they could spend no more than 30 minutes over England.<br>Their pilots faced other disadvantages. British radar could detect the approaching formations, giving the RAF's fighters a tactical advantage. All missions involved long overwater flights and the strain on the Luftwaffe fighter force proved too much. In September the Luftwaffe switched its efforts to night raids on London."},
        { "name": "Mitsubishi A6M Zero", "img": "img/zero.jpg", "description": "When Imperial Japanese forces burst like a tidal wave accross the Pacific in December 1941, they were spearheaded by the amazing Mitsubishi Zero. It was not new even then, but Western experts had shrugged off reports that Japan possessed a world-class warplane. No American fighter matched the Zero in firepower, agility or range and in the early stages of the war it was absolutely dominant.<br>The notion that Japan could produce a superb combat craft was so alien to the West that ordinary fighters like the Nakajima Ki-43 'Oscar' were mistakenly called 'Zeroes' and overestimated by besieged Americans. Colonel Claire Chennault's 'Flying Tigers' in China never saw a Zero but their combat reports fuelled growing alarm as the Japanese navy swept across the Pacific with squadrons of the real thing: the A6M, designed by Mitsubishi's Jiro Horikoshi.<br>The early successes of the Zero were due in part to its light weight, power, armament and manoeuvrability - but also partly to its brilliant and courageous pilots, many of whom fell along the way and proved difficult to replace.<br>The initial success was not to last for long. Within two years, Japan's adversaries developed new warplanes like the hard-hitting Grumman F6F Hellcat, while only minor improvements were made to the Zero. The tide turned, Japan's situation deteriorated and in the end as defeat closed in, this great fighter was reduced to the role of kamikaze - suicide - aircraft." },
        { "name": "Focke Wulf Fw 190A", "img": "img/fockewulf.jpg", "description": "Conceived in 1937 as a complement to the Bf 109, Focke-Wulf's Fw 190s became a potent threat to Allied air power in every region where the Luftwaffe fought. Fw 190s inflicted cruel punishment on Flying Fortress and Liberator crews, and were almost impossible to defeat until the long range P-51 Mustang finally became available in 1944 to escort bombers to their targets. As a fighter bomber and anti tank aircraft, the Fw 190 was Germany's best air to ground fighter.            <br>            The Fw 190a-8 was used extensively in Defence of the Riech operations during 1944. Heavily armed with four cannon and two machine guns it wreaked havoc upon US daylight bombers. The long nosed Tank Ta 152 versions of the Fw 190 reached air speeds as high as 760 km/h (472 mph) and might have altered the outcome of the war if more than 93 had been built before hostilities ended.            <br>            No one who fought in the hotly contested skies of Europe will forget the feats of Fw 190 pilots such as Oberleutnant Otto Kittel, the Luftwaffe's fourth ranking ace, who scored most of his 267 victories in the type. It is truly one of the great fighters of all time.            <br>            Kurt Tank's superb Focke-Wulf Fw 190 first saw combat over the English Channel in September 1941. The new fighter was a shock to the RAF, being faster and more agile than the Spitfire. Known as the 'Butcher Bird', the Fw 190 went to become a dominant force in aerial combat in Europe, performing with equal distinction as a fighter and as the Luftwaffe's most important ground attack machine."        }
        ]},
        { "category": "allied", "planes": [
        { "name": "Supermarine Spitfire", "img": "img/spitfire.jpg", "description": "The Spitfire is the most famous British aircraft of all time. Although less numerous than the Hawker Hurricane during the Battle of Britain, it is nevertheless remembered as the sleek, throughbred fighting machine that turned the tide during that campaign. The Spitfire is among the fastest and most manoeuvrable fighters of World War II and served in every combat there.        <br>        Supermarine designer Reginald Mitchell created a small, graceful fighter with elliptical wing and eight guns in the wings, able to fire without being hindered by the propeller. The immortal Spitfire thus became not merely one of the best-performing fighters of all time, but also one of the best-looking. Although never a long-ranged aircraft, the Spitfire was a championin an air-to-air duel. Spitfires were routinely dived at velocities approaching the speed of sound, faster than any of the German jets.        <br>        Merlin engines were used in the early versions of the Spitfire, later supplanted by the more powerful Griffon. Late Spitfires introduced a bubble canopy which made one of history's most beautiful aircraft even more appealing. The carrier-based Seafire, derived from the Spitfire Mk V, made a vital contribution to British naval air power until new American carrier fighters appeared later in the war. The Spitfire also found a new role as a tactical fighter-bomber."},
        { "name": "P-51D Mustang", "img": "img/p51dmustang.jpg", "description": "As the bombers of the Eighth Air Force fought their way deep into Hitler's German heartland, it was the Mustang that cleared the skies of Luftwaffe fighters. No other combat airplane of the war could fly as high, go as far and fight as hard as the mighty Mustang. In the skilled hands of young USAAF pilots, it took on all corners and accounted for more kills than any other Allied aircraft.<br>            Faced with imminent invasion in 1939 and desperately short of fighters, the Royal Air Force asked North American Aviation to produce urgently the existing but obsolete P-40 Warhawk. But instead the company designed, built and flew a new airplane in just 117 days - the Mustang.            <br>            Using an existing Allison engine and the latest laminar-flow wing, the new fighter immediately went into service with the RAF. In December 1941 America joined the war and it too needed good fighters fast. So the USAAF took the basic RAF Mustang, re-armed it with four machine-guns and added an uprated engine. It was a good performer, but couldn't operate well alongside the high-flying long-range bomber.            <br>            By 1944, the aircraft used the Rolls-Royce Merlin engine had a new bubble cockpit and increased firepower to six 12.7 mm (0.50 cal) machine-guns. It was now the best fighter in the war and fought superbly in all theatres as fighter, fighter-bomber and reconnaissance platform. It was loved by its aircrews and no fewer than 281 Mustang pilots became aces by scoring five kills apiece."         },
        { "name": "B-17 Flying Fortress", "img": "img/b17.jpg", "description": "In the mid-1930s, Boeing engineers suggested a big bomber to the US Army Air Corps. The best American bomber at the time was an inadequate, twin-engined adaption of the DC-3 transport. The decision to go ahead with the B-17 Flying Fortress was a courageous leap forward: it gave the United States an embryonic bomber force by the time of the attack on Pearl Harbor. Early B-17s did not have enough guns and were not available in sufficient numbers, but as the war progressed the Flying Fortresses took command of the skies.<br>B-17 crews faced unspeakabke horror, pressing ahead into Luftwaffe fighters and flak while blinded by smoke, beaten by turbulence, plagued with mechanical mishaps and paralysed by numbing cold. On the first Berlin mission, B-17 crewmen killed in the air numbered the same as Germans killed on the ground by bombs (about 400). As the bombing campaign wore on casualties aboard the B-17s remained high, but the bombing became more effective.<br>Boeing's Flying Fortress was one of the most important bombers in history. B-17s fought in every theatre of World War II, but won immortality in their epic daylight battles against the Luftwaffe in which thousands of young American flyers lost their lives transforming the impotent United States Army Air Force of early 1943 into a force of devastating, destructive power just 12 ,months later."}
        ]}
    ]
}

